In [1]:
import pandas as pd
from sqlalchemy import create_engine

## Analysing

In [5]:
# pattern: database_vendor://user:password@host_name:port/database_name
engine = create_engine('postgresql://root:root@localhost:5433/ny_taxi')

## green_tripdata

In [2]:
df = pd.read_csv('green_tripdata_2019-09.csv.gz')
df = (
    df
    .assign(
        lpep_pickup_datetime = lambda df: pd.to_datetime(df.lpep_pickup_datetime),
        lpep_dropoff_datetime = lambda df: pd.to_datetime(df.lpep_dropoff_datetime)
    )
)

/tmp/ipykernel_12851/575309533.py:1: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('green_tripdata_2019-09.csv.gz')

In [3]:
df

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2.0,2019-09-01 00:10:53,2019-09-01 00:23:46,N,1.0,65,189,5.0,2.00,10.50,0.50,0.5,2.36,0.00,NaN,0.3,14.16,1.0,1.0,0.0
1,2.0,2019-09-01 00:31:22,2019-09-01 00:44:37,N,1.0,97,225,5.0,3.20,12.00,0.50,0.5,0.00,0.00,NaN,0.3,13.30,2.0,1.0,0.0
2,2.0,2019-09-01 00:50:24,2019-09-01 01:03:20,N,1.0,37,61,5.0,2.99,12.00,0.50,0.5,0.00,0.00,NaN,0.3,13.30,2.0,1.0,0.0
3,2.0,2019-09-01 00:27:06,2019-09-01 00:33:22,N,1.0,145,112,1.0,1.73,7.50,0.50,0.5,1.50,0.00,NaN,0.3,10.30,1.0,1.0,0.0
4,2.0,2019-09-01 00:43:23,2019-09-01 00:59:54,N,1.0,112,198,1.0,3.42,14.00,0.50,0.5,3.06,0.00,NaN,0.3,18.36,1.0,1.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
449058,NaN,2019-09-30 23:13:00,2019-09-30 23:41:00,NaN,NaN,66,71,NaN,7.84,43.25,2.75,0.5,0.00,0.00,NaN,0.0,46.50,NaN,NaN,NaN
449059,NaN,2019-09-30 23:26:00,2019-09-30 23:46:00,NaN,NaN,55,26,NaN,3.56,25.75,2.75,0.5,0.00,0.00,NaN,0.0,29.00,NaN,NaN,NaN
449060,NaN,2019-09-30 23:15:00,2019-09-30 23:43:00,NaN,NaN,139,78,NaN,18.47,50.47,2.75,0.5,0.00,6.12,NaN,0.0,59.84,NaN,NaN,NaN
449061,NaN,2019-09-30 23:19:00,2019-10-01 00:06:00,NaN,NaN,242,188,NaN,20.10,58.22,2.75,0.5,0.00,6.12,NaN,0.0,67.59,NaN,NaN,NaN
449062,NaN,2019-09-30 23:35:00,2019-09-30 23:58:00,NaN,NaN,155,189,NaN,5.87,26.07,2.75,0.5,0.00,0.00,NaN,0.0,29.32,NaN,NaN,NaN

In [6]:
table_name = "yellow_taxi_data"
print(pd.io.sql.get_schema(df, name=table_name,  con=engine))

CREATE TABLE yellow_taxi_data (
	"VendorID" FLOAT(53),
	lpep_pickup_datetime TIMESTAMP WITHOUT TIME ZONE,
	lpep_dropoff_datetime TIMESTAMP WITHOUT TIME ZONE,
	store_and_fwd_flag TEXT,
	"RatecodeID" FLOAT(53),
	"PULocationID" BIGINT,
	"DOLocationID" BIGINT,
	passenger_count FLOAT(53),
	trip_distance FLOAT(53),
	fare_amount FLOAT(53),
	extra FLOAT(53),
	mta_tax FLOAT(53),
	tip_amount FLOAT(53),
	tolls_amount FLOAT(53),
	ehail_fee FLOAT(53),
	improvement_surcharge FLOAT(53),
	total_amount FLOAT(53),
	payment_type FLOAT(53),
	trip_type FLOAT(53),
	congestion_surcharge FLOAT(53)
)

In [18]:
df.head(0).to_sql(name=table_name, con=engine, if_exists='replace')

0

## lookup table

In [4]:
df_lookup = pd.read_csv('taxi+_zone_lookup.csv')

In [6]:
df_lookup

     LocationID        Borough                     Zone service_zone
0             1            EWR           Newark Airport          EWR
1             2         Queens              Jamaica Bay    Boro Zone
2             3          Bronx  Allerton/Pelham Gardens    Boro Zone
3             4      Manhattan            Alphabet City  Yellow Zone
4             5  Staten Island            Arden Heights    Boro Zone
..          ...            ...                      ...          ...
260         261      Manhattan       World Trade Center  Yellow Zone
261         262      Manhattan           Yorkville East  Yellow Zone
262         263      Manhattan           Yorkville West  Yellow Zone
263         264        Unknown                       NV          NaN
264         265        Unknown                      NaN          NaN

[265 rows x 4 columns]

In [5]:
df_lookup.to_sql(name='zones', con=engine, if_exists='replace')

265

# Analysing

In [ ]:
(
    df
    .query('(lpep_pickup_datetime.dt.day == 18)')
    .merge(df_zone[['LocationID', 'Borough']], left_on='PULocationID', right_on='LocationID',  how='left')
    .groupby('Borough')
    .agg(
        sum_borough_pu = ('total_amount','sum')
    )
    .sort_values('sum_borough_pu')
)

               sum_borough_pu
Borough
Staten Island          342.59
Unknown                728.75
Bronx                32830.09
Queens               78671.71
Manhattan            92271.30
Brooklyn             96333.24

In [ ]:
(
    df
    .merge(df_zone[['LocationID', 'Borough', 'Zone']], left_on='PULocationID', right_on='LocationID',  how='left')
    .merge(df_zone[['LocationID', 'Borough', 'Zone']], left_on='DOLocationID', right_on='LocationID',  how='left', suffixes=('_PU', '_DO'))
    .query('Zone_PU=="Astoria"')
    .query('tip_amount == tip_amount.max()')
)

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,...,total_amount,payment_type,trip_type,congestion_surcharge,LocationID_PU,Borough_PU,Zone_PU,LocationID_DO,Borough_DO,Zone_DO
98185,2.0,2019-09-08 18:10:40,2019-09-08 18:44:42,N,1.0,7,132,1.0,14.05,40.0,...,103.11,1.0,1.0,0.0,7,Queens,Astoria,132,Queens,JFK Airport

# Ingestion